results/MariaDB/Broadwell/events/dyni-select_random_points.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            43582
        write:                           0
        other:                           0
        total:                           43582
    transactions:                        43582  (726.32 per sec.)
    queries:                             43582  (726.32 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0021s
    total number of events:              43582

Latency (ms):
         min:                                  0.27
         avg:                                  1.38
         max:                                623.17
         95th percentile:                      2.22
         sum:                              59958.08

Threads fairness:
    events (avg/stddev):           43582.0000/0.00
    execution time (avg/stddev):   59.9581/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            349501
        write:                           0
        other:                           0
        total:                           349501
    transactions:                        349501 (5824.78 per sec.)
    queries:                             349501 (5824.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0004s
    total number of events:              349501

Latency (ms):
         min:                                  0.08
         avg:                                  0.34
         max:                                640.78
         95th percentile:                      1.47
         sum:                             119636.80

Threads fairness:
    events (avg/stddev):           174750.5000/143013.50
    execution time (avg/stddev):   59.8184/0.14

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1521948
        write:                           0
        other:                           0
        total:                           1521948
    transactions:                        1521948 (25364.76 per sec.)
    queries:                             1521948 (25364.76 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0004s
    total number of events:              1521948

Latency (ms):
         min:                                  0.09
         avg:                                  0.16
         max:                                  2.86
         95th percentile:                      0.13
         sum:                             238634.50

Threads fairness:
    events (avg/stddev):           380487.0000/194871.42
    execution time (avg/stddev):   59.6586/0.17

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2104408
        write:                           0
        other:                           0
        total:                           2104408
    transactions:                        2104408 (35071.40 per sec.)
    queries:                             2104408 (35071.40 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0014s
    total number of events:              2104408

Latency (ms):
         min:                                  0.09
         avg:                                  0.23
         max:                                 86.69
         95th percentile:                      0.23
         sum:                             477211.28

Threads fairness:
    events (avg/stddev):           263051.0000/90004.65
    execution time (avg/stddev):   59.6514/0.12

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2225717
        write:                           0
        other:                           0
        total:                           2225717
    transactions:                        2225717 (37092.65 per sec.)
    queries:                             2225717 (37092.65 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0022s
    total number of events:              2225717

Latency (ms):
         min:                                  0.10
         avg:                                  0.43
         max:                                139.50
         95th percentile:                      0.47
         sum:                             956911.23

Threads fairness:
    events (avg/stddev):           139107.3125/32728.01
    execution time (avg/stddev):   59.8070/0.05

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2442799
        write:                           0
        other:                           0
        total:                           2442799
    transactions:                        2442799 (40709.65 per sec.)
    queries:                             2442799 (40709.65 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0034s
    total number of events:              2442799

Latency (ms):
         min:                                  0.11
         avg:                                  0.78
         max:                               3106.14
         95th percentile:                      0.86
         sum:                            1916579.61

Threads fairness:
    events (avg/stddev):           76337.4688/12845.46
    execution time (avg/stddev):   59.8931/0.02

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2392641
        write:                           0
        other:                           0
        total:                           2392641
    transactions:                        2392641 (39872.78 per sec.)
    queries:                             2392641 (39872.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0049s
    total number of events:              2392641

Latency (ms):
         min:                                  0.10
         avg:                                  1.60
         max:                               5651.00
         95th percentile:                      1.79
         sum:                            3836043.99

Threads fairness:
    events (avg/stddev):           37385.0156/5274.85
    execution time (avg/stddev):   59.9382/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2359042
        write:                           0
        other:                           0
        total:                           2359042
    transactions:                        2359042 (39309.02 per sec.)
    queries:                             2359042 (39309.02 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0108s
    total number of events:              2359042

Latency (ms):
         min:                                  0.10
         avg:                                  3.25
         max:                              12247.22
         95th percentile:                      3.68
         sum:                            7675952.67

Threads fairness:
    events (avg/stddev):           18430.0156/2896.52
    execution time (avg/stddev):   59.9684/0.01